Repository: aliyazdi75/aliyazdi75.github.io
Catalog: lib/l10n/intl_*.arb
Languages: fa

# mySiteTitle
source: Ali Yazdi Homepage
fa: صفحه شخصی علی یزدی

# myName
source: ALI YAZDI
fa: علی یزدی

# myTitle
source: CE GRADUATED @ TEHRAN POLYTECHNIC
fa: فارغ التحصیل مهندسی کامپیوتر @ پلی‌تکنیک تهران

# welcomeTitle
source: Hi there, welcome to my page
fa: سلام، به صفحه شخصی من خوش آمدید

# aboutMe
source: I have been working as a Flutter developer and mobile team leader for two years. A Software Engineering graduate who interests in using Artificial Intelligence and Software Engineering in my work experiences. An open-source advocate who helps developers to solve their problems in development. I am looking for a better opportunity and willing to relocate anywhere.
fa: من به عنوان برنامه نویس فلاتر و سرپرست تیم موبایل به مدت دو سال کار میکنم. من فارغ التحصیل مهندسی کامپیوتر که علاقه به استفاده از هوش مصنوعی و مهندسی نرم افزار در تجربه های کاریم دارد. من یک طرفدار متن باز هستم که به برنامه نویسان در رفع مشکلاتشون در توسعه برنامه کمک میکنم. من درحال پیدا کردن موقعیت شغلی بهتر در یک کشور دیگر می باشم.

source: Resume
fa: رزومه

# aboutTitle
source: ABOUT
fa: درباره

# educationTitle
source: EDUCATION
fa: تحصیلات

# experienceTitle
source: EXPERIENCE
fa: تجربه کاری

# awardsTitle
source: AWARDS
fa: افتخارات

# amirkabirTitle
source: Amirkabir University of Technology
fa: دانشگاه صنعتی امیرکبیر

# polytechnicTitle
source: (Tehran Polytechnic)
fa: (پلی‌تکنیک تهران)

# amirkabirCity
source: , Tehran, Iran
fa: ، ایران، تهران

# amirkabirStudyFieldTitle
source: B.Sc., Computer Engineering, Software
fa: کارشناسی مهندسی کامپیوتر، گرایش نرم‌افزار

# amirkabirStudyStart
source: September 2015
fa: مهر ۱۳۹۴

# amirkabirStudyEnd
source: January 2020
fa: دی ۱۳۹۸

# schoolTitle
source: Adab High School
fa: دبیرستان ادب

# schoolCity
source: Tehran, Iran
fa: ایران، تهران

# schoolStudyStart
source: September 2011
fa: مهر ۱۳۹۰

# schoolStudyEnd
source: June 2014
fa: خرداد ۱۳۹۳

# schoolStudyFieldTitle
source: Diploma in Physics and Mathematics
fa: دیپلم ریاضی و فیزیک

# tarafdariTitle
source: Tarafdari
fa: طرفداری

# tarafdariCity
source: Tehran, Iran
fa: ایران، تهران

# tarafdariWorkStart
source: March 2019
fa: اسفند ۱۳۹۸

# tarafdariWorkEnd
source: May 2020
fa: اردیبهشت ۱۳۹۹

# tarafdariTechnologies
source: Flutter, Drupal, Laravel, MySQL
fa: فلاتر، دروپال، لاراول، مای‌اس‌کیو‌ال

# tarafdariDescription
source: Working as a mobile application team leader at one of the most popular sport social media.
fa: به عنوان رهبر تیم برنامه موبایل در محبوبترین شبکه اجتماعی ورزشی مشغول به کار بودم.

# tarafdariDuty1
source: R&D about Flutter framework and migrating the android application to Flutter application includes multimedia content, live score matches, and sports TV streaming with live chat on the socket.
fa: مطالعه و تحقیق در مورد فریم‌ورک فلاتر و مهاجرت اپلیکیشن اندروید طرفداری به فلاتر، که این برنامه شامل محتوای چند رسانه‌ای، نتایج زنده بازی‌های ورزشی، استریمینگ پخش زنده بازی‌های ورزشی روی سوکت است.

# tarafdariDuty2
source: We could reach more than 200k active users on the Google Play Store after migrating to the flutter.
fa: ما توانستیم به بیش از ۲۰۰ هزار نصب فعال بعد از مهاجرت به فلاتر در فروشگاه گوگل پلی برسیم.

source: Application Page
fa: صفحه برنامه

# mateMachineTitle
source: Mate Machine Inc.
fa: میت ماشین

# mateMachineCity
source: Vancouver, BC, Canada
fa: کانادا، ونکوور

# mateMachineWorkStart
source: June 2019
fa: خرداد ۱۳۹۹

# mateMachineWorkEnd
source: Present
fa: اکنون

# mateMachineTechnologies
source: Flutter
fa: فلاتر

# mateMachineDescription
source: Working as a flutter developer team leader to launch the application in three months.
fa: من به عنوان رهبر تیم برنامه نویسی فلاتر برای لانچ در سه ماه آینده مشغول به کار هستم.

# olympiadDate
source: July 2013
fa: تیر ۱۳۹۳

# olympiadDescription
source: Qualified for the Second Round of the Iranian Physics Olympiad and Mathematical Olympiad
fa: پذیرش برای مرحله دوم المپیاد فیزیک و المپیاد ریاضی

# examDate
source: July 2015
fa: تیر ۱۳۹۴

# examDescription
source: Ranked in top 0.2% among more than 180K participants in Nation-Wide University Entrance Exam among all Iranian Student of Physics and Mathematics
fa: رتبه بالاترین ۰/۲٪ در میان بیش از ۱۸۰ هزار نفر شرکت‌کننده در کنکور سراسری ریاضی و فیزیک

# bestAppDate
source: February 2020
fa: بهمن ۱۳۹۸

# bestAppDescription
source: First Place in the 12th Iran Web and Mobile Festival({value}) for the Best Sport Mobile Application among 7k applications
fa: مقام اول در دوازدهمین جشنواره وب و موبایل({value}) برای بهترین برنامه ورزشی در میان ۷ هزار برنامه

source: Made with
fa: ساخته شده با

# byTitle
source: by {value}
fa: توسط {value}

# flutterTitle
source: Flutter
fa: فلاتر

# mostDownloadAppDate
source: February 2020
fa: بهمن ۱۳۹۸

# mostDownloadAppDescription
source: Most installed sport application in Iran, we could reach more than 200k active users on the {value} after migrating to the flutter
fa: بیشترین دانلود برنامه ورزشی در ایران، ما توانستیم به بیش از ۲۰۰ هزار نصب فعال در {value} برسیم

# mostDownloadAppLink
source: Google Play Store
fa: فروشگاه گوگل پلی
